# 분포와 기술 통계
데이터의 분포 알아 보기 
* 기술 통계 (descriptive statistics)
* 히스토그램 (histogram)
* 커널 밀도 (kernel density)

# 기술 통계
* 데이터의 숫자 (count)
* 평균 (mean, average)
* 분산 (variance)
* 표준 편차 (standard deviation)
* 최댓값 (maximum)
* 최솟값 (minimum)
* 중앙값 (median)
* 사분위수 (quartile)

In [1]:
import numpy as np
import pandas as pd

In [2]:
x = np.array([ 18,   5,  10,  23,  19,  -8,  10,   0,   0,   5,   2,  15,   8,
                2,   5,   4,  15,  -1,   4,  -7, -24,   7,   9,  -6,  23, -13,
                1,   0,  16,  15,   2,   4,  -7, -18,  -2,   2,  13,  13,  -2,
               -2,  -9, -13, -16,  20,  -4,  -3, -11,   8, -15,  -1,  -7,   4,
               -4, -10,   0,   5,   1,   4,  -5,  -2,  -5,  -2,  -7, -16,   2,
               -3, -15,   5,  -8,   1,   8,   2,  12, -11,   5,  -5,  -7,  -4])

In [3]:
len(x) #row 개수

78

In [4]:
np.mean(x) # 평균

0.69230769230769229

In [5]:
np.var(x) # 분산

96.059171597633139

In [6]:
np.std(x) # 표준편차

9.8009780939268065

In [7]:
np.max(x) # 최대값

23

In [8]:
np.min(x) # 최소값

-24

In [9]:
np.median(x) # 중앙값

0.5

In [11]:
np.percentile(x, 25) # 1사분위수

-5.75

In [12]:
np.percentile(x, 75) # 3사분위수

5.0

In [13]:
# 기술 통계값
s = pd.Series(x)
s.describe()

count    78.000000
mean      0.692308
std       9.864416
min     -24.000000
25%      -5.750000
50%       0.500000
75%       5.000000
max      23.000000
dtype: float64

# 피봇테이블과 그룹 분석
## 피봇 테이블
데이터 열(column) 중에서 두 개를 키(key)로 사용하여 데이터를 선택하는 방법<br>
주어진 데이터가 없으면 NaN 값을 넣음

* 행 인덱스 (row index)
* 열 인덱스 (column index)

**pivot** ("행인덱스 열이름", "열인덱스로 사용할 열이름", "데이터로 사용할 열이름")

In [14]:
data = {
    'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
    'year': [2000, 2001, 2002, 2001, 2002],
    'pop': [1.5, 2.5, 3.0, 2.5, 3.5]
}
df = pd.DataFrame(data, columns=["state", "year", "pop"])
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  2.5
2    Ohio  2002  3.0
3  Nevada  2001  2.5
4  Nevada  2002  3.5

In [15]:
df.pivot("state", "year", "pop")

year    2000  2001  2002
state
Nevada   NaN   2.5   3.5
Ohio     1.5   2.5   3.0

set_index 명령과 unstack 명령을 사용 (유일한 값을 사용해야함)

In [18]:
df.set_index(["state", "year"]).unstack()

        pop
year   2000 2001 2002
state
Nevada  NaN  2.5  3.5
Ohio    1.5  2.5  3.0

## 그룹 분석
- 분석하고자 하는 시리즈나 데이터프레임에 groupby 메서드를 호출
- 호출한 결과에 그룹 연산을 수행

### groupby 메서드
- 열 또는 열의 리스트
- 행 인덱스

### 그룹 연산 메서드
https://pandas.pydata.org/pandas-docs/stable/api.html#groupby

- **size(), count()** : 갯수
- **mean(), median(), min(), max()** : 평균, 중앙값, 최소, 최대
- **sum(), prod(), std(), var(), quantile()** : 합계, 곱, 표준편차, 분산, 사분위수
- **first(), last()** : 가장 첫번째 데이터와 가장 나중 데이터

- **agg(), aggregate()** <br>
만약 원하는 그룹 연산이 없는 경우 함수를 만들고 이 함수를 agg()에 전달<br>
또는 여러가지 그룹 연산을 동시에 하고 싶은 경우 함수 이름 문자열의 리스트를 전달

- **transform()**
그룹 연산으로 대표값을 만든 다음, 이 대표 값을 새로운 열(column)로 원래 데이터프레임에 추가

- **describe()**
하나의 그룹 대표값이 아니라 여러개의 값을 데이터프레임으로 구함

- **apply()**
describe() 처럼 하나의 대표값이 아닌 데이터프레임을 출력하지만 원하는 그룹 연산이 없는 경우에 사용

In [19]:
np.random.seed(0)
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)})
df

      data1     data2 key1 key2
0  1.764052 -0.977278    a  one
1  0.400157  0.950088    a  two
2  0.978738 -0.151357    b  one
3  2.240893 -0.103219    b  two
4  1.867558  0.410599    a  one

In [20]:
df.groupby(df.key1).mean()

         data1     data2
key1
a     1.343923  0.127803
b     1.609816 -0.127288

In [21]:
df.data1.groupby(df.key1).mean()

key1
a    1.343923
b    1.609816
Name: data1, dtype: float64

In [22]:
df.groupby(df.key1)["data1"].mean() # data1 만 뽑아서 평균을 구함

key1
a    1.343923
b    1.609816
Name: data1, dtype: float64

In [25]:
df.groupby(df.key1).mean()["data1"] # 각각 평균을 구한 후 data1 만 뽑음

key1
a    1.343923
b    1.609816
Name: data1, dtype: float64

In [26]:
df.data1.groupby([df.key1, df.key2]).mean() # 복합 키에 대한 평균

key1  key2
a     one     1.815805
      two     0.400157
b     one     0.978738
      two     2.240893
Name: data1, dtype: float64

In [27]:
# unstack 피봇 테이블 형태로 만듬
df.data1.groupby([df.key1, df.key2]).mean().unstack("key2")

key2       one       two
key1
a     1.815805  0.400157
b     0.978738  2.240893

## pivot_table
groupby 명령처럼 그룹 분석을 하지만 최종적으로는 pivot 명령처럼 피봇테이블을 반환<br>
groupby 명령의 결과에 unstack을 자동 적용하여 2차원적인 형태로 변형

* **pivot_table(data, values=None, index=None, columns=None, aggfunc='mean', fill_value=None, margins=False, margins_name='All')**
    - data: 분석할 데이터프레임 (메서드일 때는 필요하지 않음)
    - values: 분석할 데이터프레임에서 분석할 열
    - index: 행 인덱스로 들어갈 키 열 또는 키 열의 리스트
    - columns: 열 인덱스로 들어갈 키 열 또는 키 열의 리스트
    - aggfunc: 분석 메서드
    - fill_value: NaN 대체 값
    - margins: 오른쪽과 아래에 합계를 붙일지 여부
    - margins_name: 합계 열(행)의 이름

In [28]:
df

      data1     data2 key1 key2
0  1.764052 -0.977278    a  one
1  0.400157  0.950088    a  two
2  0.978738 -0.151357    b  one
3  2.240893 -0.103219    b  two
4  1.867558  0.410599    a  one

In [29]:
df.pivot_table("data1", "key1", "key2")

key2       one       two
key1
a     1.815805  0.400157
b     0.978738  2.240893

In [30]:
df.pivot_table("data1", "key1", "key2", margins=True, margins_name="합계")

key2       one       two        합계
key1
a     1.815805  0.400157  1.343923
b     0.978738  2.240893  1.609816
합계    1.536783  1.320525  1.450280

## 예제) TIP 데이터 
식당에서 식사 후 내는 팁(tip) 으로 보는 데이터분석 예제

In [32]:
import seaborn as sns
tips = sns.load_dataset("tips")
tips.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

- total_bill: 식사대금
- tip: 팁
- sex: 성별
- smoker: 흡연/금연 여부
- day: 요일
- time: 시간
- size: 인원

In [35]:
# 식사대금 별 팁 컬럼 추가 
tips['tip_pct'] = tips['tip']/tips['total_bill']
tips.tail()

     total_bill   tip     sex smoker   day    time  size   tip_pct
239       29.03  5.92    Male     No   Sat  Dinner     3  0.203927
240       27.18  2.00  Female    Yes   Sat  Dinner     2  0.073584
241       22.67  2.00    Male    Yes   Sat  Dinner     2  0.088222
242       17.82  1.75    Male     No   Sat  Dinner     2  0.098204
243       18.78  3.00  Female     No  Thur  Dinner     2  0.159744

In [36]:
tips.describe()

       total_bill         tip        size     tip_pct
count  244.000000  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672    0.160803
std      8.902412    1.383638    0.951100    0.061072
min      3.070000    1.000000    1.000000    0.035638
25%     13.347500    2.000000    2.000000    0.129127
50%     17.795000    2.900000    2.000000    0.154770
75%     24.127500    3.562500    3.000000    0.191475
max     50.810000   10.000000    6.000000    0.710345

### 그룹별 통계

In [38]:
# 성별
tips.groupby("sex").count()

        total_bill  tip  smoker  day  time  size  tip_pct
sex
Male           157  157     157  157   157   157      157
Female          87   87      87   87    87    87       87